validation/halfChannel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       19750;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       19800;
    }
    wallTop
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       19850;
    }
    symBottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          200;
        startFace       20050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20250;
    }
)

// ************************************************************************* //
